_posts/c_sharp/2014-05-10-c#-notes.html
---
layout: post
title: C# ASP.NET Notes
author: zrg
comments: false
description: C# 开发笔记
categories:
- c#
tags:
- C#
- ASP.NET
photos:
---

<div id="outline-container-orgd01c809" class="outline-2">
<h2 id="orgd01c809">字符串操作</h2>
<div class="outline-text-2" id="text-orgd01c809">
</div>
<div id="outline-container-org2c4d3d6" class="outline-3">
<h3 id="org2c4d3d6">String.Substring()</h3>
<div class="outline-text-3" id="text-org2c4d3d6">
<pre class="example">
//格式
String.Substring(int beginIndex)
String.Substring(int beginIndex,int endIndex)
//示例
string str_new=str.Substring(6,2)：表示从str中截取位置为6的字符开始长度为2的字符串，6表示子字符的起始位置，2表示子字符的字符长度。
</pre>
</div>
</div>
<div id="outline-container-orgadfbb45" class="outline-3">
<h3 id="orgadfbb45">其他方法</h3>
<div class="outline-text-3" id="text-orgadfbb45">
<pre class="example">
//格式
int indexOf(String str) 返回第一次出现的指定子字符串在此字符串中的索引。
int indexOf(String str, int fromIndex) 从指定的索引处开始，返回第一次出现的指定子字符串在此字符串中的索引。
int lastIndexOf(String str) 返回在此字符串中最右边出现的指定子字符串的索引。
int lastIndexOf(String str, int fromIndex) 从指定的索引处开始向后搜索，返回在此字符串中最后一次出现的指定子字符串的索引。 
int length() 返回此字符串的长度。
boolean startsWith(String prefix) 测试此字符串是否以指定的前缀开始。 
boolean startsWith(String prefix, int toffset) 测试此字符串是否以指定前缀开始，该前缀以指定索引开始。
//示例
str.Substring(0,str.LastIndexOf(","));
</pre>
</div>
</div>
<div id="outline-container-org0f0f520" class="outline-3">
<h3 id="org0f0f520">参考资料</h3>
<div class="outline-text-3" id="text-org0f0f520">
<pre class="example">
http://www.blogjava.net/AndyZhang/archive/2012/04/25/376614.html
http://www.cnblogs.com/rocblog/archive/2013/05/07/3064593.html
http://www.cnblogs.com/Deckard/archive/2009/06/03/1495452.html
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf3f160" class="outline-2">
<h2 id="orgcf3f160">日期时间处理</h2>
<div class="outline-text-2" id="text-orgcf3f160">
</div>
<div id="outline-container-orgd2e88db" class="outline-3">
<h3 id="orgd2e88db">C#正则表达式判断输入日期格式是否正确</h3>
<div class="outline-text-3" id="text-orgd2e88db">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#26159;&#21542;&#20026;&#26085;&#26399;&#22411;&#23383;&#31526;&#20018;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"StrSource"</span>&gt;&#26085;&#26399;&#23383;&#31526;&#20018;(2008-05-08)&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static bool IsDate(string StrSource)
{
     return Regex.IsMatch(StrSource, @<span style="color: #CDC673;">"^((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-9]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-))$"</span>)<span style="color: #8B8878;">;</span>
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#26159;&#21542;&#20026;&#26102;&#38388;&#22411;&#23383;&#31526;&#20018;
// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"source"</span>&gt;&#26102;&#38388;&#23383;&#31526;&#20018;(15:00:00)&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static bool IsTime(string StrSource)
{
     return Regex.IsMatch(StrSource, @<span style="color: #CDC673;">"^((20|21|22|23|[0-1]?\d):[0-5]?\d:[0-5]?\d)$"</span>)<span style="color: #8B8878;">;</span>
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#26159;&#21542;&#20026;&#26085;&#26399;+&#26102;&#38388;&#22411;&#23383;&#31526;&#20018;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"source"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static bool IsDateTime(string StrSource)
{
    return Regex.IsMatch(StrSource, @<span style="color: #CDC673;">"^(((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-)) (20|21|22|23|[0-1]?\d):[0-5]?\d:[0-5]?\d)$ "</span>)<span style="color: #8B8878;">;</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ecfee9" class="outline-3">
<h3 id="org6ecfee9">C#利用线程、委托，实时显示时间</h3>
<div class="outline-text-3" id="text-org6ecfee9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region &#36816;&#34892;&#26102;&#26174;&#31034;&#23454;&#26102;&#26102;&#38388;
new Thread(() =&gt;
{
        while (true)
        {
           try
           {
               labelTime.BeginInvoke(new MethodInvoker(() =&gt; labelTime.Text = DateTime.Now.ToString()))<span style="color: #8B8878;">;</span>
           }
           catch (Exception)
           {
           }
           Thread.Sleep(1000)<span style="color: #8B8878;">;</span>
         }
        })
  { IsBackground = true }.Start()<span style="color: #8B8878;">;</span>
#endregion
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org278d6cc" class="outline-2">
<h2 id="org278d6cc">C#中无法引用自己创建的类库中的类</h2>
<div class="outline-text-2" id="text-org278d6cc">
</div>
<div id="outline-container-orgc3f46c3" class="outline-3">
<h3 id="orgc3f46c3">问题描述</h3>
<div class="outline-text-3" id="text-orgc3f46c3">
<pre class="example">
新建一个类，定义了一些方法，在外部引用该类时，不能引用。
</pre>
</div>
</div>
<div id="outline-container-org6cfa6f1" class="outline-3">
<h3 id="org6cfa6f1">解决办法</h3>
<div class="outline-text-3" id="text-org6cfa6f1">
<pre class="example">
1.检查类前面有没有添加加或使用public。
2.类中定义的方法也应该是public类型的
3.改完之后将该类库重新生成一次
4.注意类名不要与系统保留字冲突
</pre>
</div>
</div>
<div id="outline-container-org87f1d78" class="outline-3">
<h3 id="org87f1d78">参考资料</h3>
<div class="outline-text-3" id="text-org87f1d78">
<pre class="example">
https://www.ezloo.com/2008/10/classlibrary_visited.html
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4a2085" class="outline-2">
<h2 id="orgd4a2085">获取指定范围的n个随机数</h2>
<div class="outline-text-2" id="text-orgd4a2085">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region &#38543;&#26426;&#25968;&#33719;&#21462;
        /**
         * &#33719;&#21462;&#35268;&#23450;&#33539;&#22260;&#20869;&#30340;n&#20010;&#38543;&#26426;&#25968;
         * 
         * min_value    int    &#38543;&#26426;&#25968;&#19979;&#38480;
         * max_value    int    &#38543;&#26426;&#25968;&#19978;&#38480;
         * number       int    &#38543;&#26426;&#25968;&#37327;
         */
        private string getRandom(int min_value, int max_value, int number)
        {
            Random random = new Random()<span style="color: #8B8878;">;</span>
            ArrayList arr = new ArrayList()<span style="color: #8B8878;">;</span>
            int temp = 0<span style="color: #8B8878;">;</span>
            for (int i = 0<span style="color: #8B8878;">; </span><span style="color: #8B8878;">i &lt; number; i++)</span>
            {
                temp = random.Next(min_value, max_value)<span style="color: #8B8878;">; </span><span style="color: #8B8878;">//&#38543;&#26426;&#21462;&#25968;</span>
                arr.Add(temp)<span style="color: #8B8878;">;</span>
            }
            string str = <span style="color: #CDC673;">""</span><span style="color: #8B8878;">;</span>
            for (int j = 0<span style="color: #8B8878;">; </span><span style="color: #8B8878;">j &lt; arr.Count; j++)</span>
            {
                str += arr[j].ToString() + <span style="color: #CDC673;">","</span><span style="color: #8B8878;">;</span>
                //Console.Write(arr[j].ToString())<span style="color: #8B8878;">;</span>
            }
            return str.Substring(0, str.LastIndexOf(<span style="color: #CDC673;">","</span>))<span style="color: #8B8878;">;</span>
        }
#endregion
</pre>
</div>
</div>
</div>
<div id="outline-container-org1545234" class="outline-2">
<h2 id="org1545234">DataTable 序列化</h2>
<div class="outline-text-2" id="text-org1545234">
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org444c572">/// &lt;summary&gt;
/// &#24207;&#21015;&#21270;DataTable&#25104;XML
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"dt"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
private static string SerializeDataTableToXml(DataTable dt)
{
    StringBuilder strBuilder = new StringBuilder()<span style="color: #8B8878;">;</span>
    XmlWriter writer = XmlWriter.Create(strBuilder)<span style="color: #8B8878;">;</span>
    XmlSerializer serializer = new XmlSerializer(typeof(DataTable))<span style="color: #8B8878;">;</span>
    serializer.Serialize(writer, dt)<span style="color: #8B8878;">;</span>
    writer.Close()<span style="color: #8B8878;">;</span>
    return strBuilder.ToString()<span style="color: #8B8878;">;</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge0b5b53">/// &lt;summary&gt;
/// &#24207;&#21015;&#21270;XML&#25104;DataTable
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #CDC673;">"xml"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
private static DataTable SerializeXmlToDataTable(string xml)
{
    StringReader strReader = new StringReader(xml)<span style="color: #8B8878;">;</span>
    XmlReader xmlReader = XmlReader.Create(strReader)<span style="color: #8B8878;">;</span>
    XmlSerializer serializer = new XmlSerializer(typeof(DataTable))<span style="color: #8B8878;">;</span>
    DataTable dt = serializer.Deserialize(xmlReader) as DataTable<span style="color: #8B8878;">;</span>
    return dt<span style="color: #8B8878;">;</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org197f7d0">DMWebSvrSoapClient dmwss = new DMWebSvrSoapClient()<span style="color: #8B8878;">;</span>
DateTime date = DateTime.Now<span style="color: #8B8878;">;</span>
string dataStr1 = dmwss.GetVehicleInfo_Month(date.ToString(<span style="color: #CDC673;">"yyyy-MM-dd"</span>))<span style="color: #8B8878;">;</span>

XmlDocument xmldoc = new XmlDocument()<span style="color: #8B8878;">;</span>
xmldoc.LoadXml(dataStr1)<span style="color: #8B8878;">;</span>
XmlNodeList xnList = xmldoc.SelectNodes(<span style="color: #CDC673;">"//DocumentElement/list"</span>)<span style="color: #8B8878;">;</span>
foreach (XmlNode xn in xnList)
{
     ListViewItem item = new ListViewItem(xn[<span style="color: #CDC673;">"time"</span>].InnerText)<span style="color: #8B8878;">;</span>
     item.SubItems.Add(xn[<span style="color: #CDC673;">"in_vehicle_count"</span>].InnerText)<span style="color: #8B8878;">;</span>
     item.SubItems.Add(xn[<span style="color: #CDC673;">"out_vehicle_count"</span>].InnerText)<span style="color: #8B8878;">;</span>
     listView.Items.Add(item)<span style="color: #8B8878;">;</span>
}
</pre>
</div>
</div>
<div id="outline-container-org7c06cd6" class="outline-3">
<h3 id="org7c06cd6">参考资料</h3>
<div class="outline-text-3" id="text-org7c06cd6">
<pre class="example">
http://stackoverflow.com/questions/6402596/xml-string-to-xml-document
https://zhidao.baidu.com/question/574030822.html
https://msdn.microsoft.com/en-us/library/hcebdtae(v=vs.110).aspx
</pre>
</div>
</div>
</div>
